ДоставкаЗаказов/src/Documents/ЗаявкаНаТранспорт/ЗаявкаНаТранспорт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявкаНаТранспорт</name>
  <basedOn>Document.ПродажаТоваров</basedOn>
  <registerRecords>AccumulationRegister.ПробегТранспорта</registerRecords>
  <registerRecords>InformationRegister.СостояниеДоставки</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДоставки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ПродажаТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>Транспорт</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>НачальныйПробег</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.Водители</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрузчикПервый</name>
    <type>
      <types>CatalogRef.Грузчики</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрузчикВторой</name>
    <type>
      <types>CatalogRef.Грузчики</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеЗаказа</name>
    <type>
      <types>EnumRef.СостояниеЗаказа</types>
    </type>
  </attributes>
  <attributes>
    <name>Расстояние</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Document>

ДоставкаЗаказов/src/AccumulationRegisters/ПробегТранспорта/ПробегТранспорта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ПробегТранспорта</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Рейсы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НачальныйПробег</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Расстояние</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.Водители</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Транспорт</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ДоставкаЗаказов/src/InformationRegisters/СостояниеДоставки/СостояниеДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостояниеДоставки</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>СостояниеЗаказа</name>
    <type>
      <types>EnumRef.СостояниеЗаказа</types>
    </type>
  </resources>
  <resources>
    <name>НачальныйПробег</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>АдресДоставки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Транспорт</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.Водители</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ГрузчикПервый</name>
    <type>
      <types>CatalogRef.Грузчики</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ГрузчикВторой</name>
    <type>
      <types>CatalogRef.Грузчики</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ДоставкаЗаказов/src/Enums/СостояниеЗаказа/СостояниеЗаказа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостояниеЗаказа</name>
  <enumValues>
    <name>НеВыехали</name>
  </enumValues>
  <enumValues>
    <name>ВДорогеККлиенту</name>
  </enumValues>
  <enumValues>
    <name>УКлиента</name>
  </enumValues>
  <enumValues>
    <name>ВДорогеОбратно</name>
  </enumValues>
  <enumValues>
    <name>Отработан</name>
  </enumValues>
</mdclass:Enum>

ДоставкаЗаказов/src/Documents/ПродажаТоваров/ПродажаТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПродажаТоваров</name>
  <basedOn>Document.ПоступлениеТоваров</basedOn>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиНоменклатуры</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.Серии</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ДоставкаЗаказов/src/Documents/ЗаявкаНаТранспорт/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ,Режим)
	
	ПроверяемыеРеквизиты = ПроверяемыеРеквизиты();
	ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты);
	ВыборкаДетальныеЗаписи = ДанныеДвижений(Отказ);
	ЗаписатьДвижения(ВыборкаДетальныеЗаписи);

КонецПроцедуры
	
Процедура ОбработкаЗаполнения(ДанныеЗаполнения,СтандартнаяОбработка)
	
	РезультатЗапроса = ДанныеЗаполнения(ДанныеЗаполнения);
	ЗаписатьДанныеЗаполнения(РезультатЗапроса);

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Условие = (Расстояние = 0);
	ОбщегоНазначенияВызовСервера.ПроверитьУсловие(Отказ, Условие, "Поле Расстояние должно быть заполнено");	
	
	Условие = ДатаДоставки < ТекущаяДатаСеанса();
	ОбщегоНазначенияВызовСервера.ПроверитьУсловие(Отказ, Условие, "Дата плановой доставки не может быть в прошедшем периоде");		
	
	Условие = НЕ ЗначениеЗаполнено(Контрагент);
	ОбщегоНазначенияВызовСервера.ПроверитьУсловие(Отказ, Условие, "Поле Контрагент должно быть заполнено");			
	
	Условие = НЕ ЗначениеЗаполнено(КонтактноеЛицо);
	ОбщегоНазначенияВызовСервера.ПроверитьУсловие(Отказ, Условие, "Поле Контакное лицо должно быть заполнено");				
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Условие = НЕ ЗначениеЗаполнено(Транспорт);
	ОбщегоНазначенияВызовСервера.ПроверитьУсловие(Отказ, Условие, "Поле Транспорт должно быть заполнено");				
	
	Условие = НЕ ЗначениеЗаполнено(Водитель);
	ОбщегоНазначенияВызовСервера.ПроверитьУсловие(Отказ, Условие, "Поле Водитель должно быть заполнено");				
		
	Условие = НЕ ЗначениеЗаполнено(ГрузчикПервый);
	ОбщегоНазначенияВызовСервера.ПроверитьУсловие(Отказ, Условие, "Поле ГрузчикПервый должно быть заполнено");				
	
	Условие = НЕ ЗначениеЗаполнено(ГрузчикВторой);
	ОбщегоНазначенияВызовСервера.ПроверитьУсловие(Отказ, Условие, "Поле ГрузчикВторой должно быть заполнено");				
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДанныеДвижений(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗаявкаНаТранспорт.Дата КАК Период,
		|	ЗаявкаНаТранспорт.Транспорт КАК Транспорт,
		|	ЗаявкаНаТранспорт.Водитель КАК Водитель,
		|	ЗаявкаНаТранспорт.ГрузчикПервый КАК ГрузчикПервый,
		|	ЗаявкаНаТранспорт.ГрузчикВторой КАК ГрузчикВторой,
		|	ЗаявкаНаТранспорт.СостояниеЗаказа КАК СостояниеЗаказа,
		|	ЗаявкаНаТранспорт.Расстояние КАК Расстояние,
		|	ЗаявкаНаТранспорт.НачальныйПробег,
		|	ЗаявкаНаТранспорт.КонтактноеЛицо.Адрес КАК АдресДоставки,
		|	1 КАК Рейсы
		|ИЗ
		|	Документ.ЗаявкаНаТранспорт КАК ЗаявкаНаТранспорт
		|ГДЕ
		|	ЗаявкаНаТранспорт.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Отказ = Истина;
	КонецЕсли;
		
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Возврат ВыборкаДетальныеЗаписи;
	
КонецФункции

Процедура ЗаписатьДвижения(ВыборкаДетальныеЗаписи)
	
	Движения.ПробегТранспорта.Записывать 	= Истина;
	Движения.СостояниеДоставки.Записывать 	= Истина;
	
	ВыборкаДетальныеЗаписи.Следующий();	
	
	Движение = Движения.СостояниеДоставки.Добавить();
	ЗаполнитьЗначенияСвойств(Движение, ВыборкаДетальныеЗаписи);	
	
	Если ВыборкаДетальныеЗаписи.СостояниеЗаказа <> Перечисления.СостояниеЗаказа.Отработан Тогда
		Возврат;
	КонецЕсли;
	
	Движение = Движения.ПробегТранспорта.Добавить();
	ЗаполнитьЗначенияСвойств(Движение, ВыборкаДетальныеЗаписи);
	
КонецПроцедуры

Функция ДанныеЗаполнения(ДанныеЗаполнения)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПродажаТоваров") Тогда

		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	ПродажаТоваров.Ссылка КАК Основание,
			|	ПродажаТоваров.Контрагент,
			|	ПродажаТоваров.КонтактноеЛицо,
			|	ПродажаТоваров.СуммаДокумента,
			|	ПродажаТоваров.КонтактноеЛицо.Адрес КАК Адрес
			|ИЗ
			|	Документ.ПродажаТоваров КАК ПродажаТоваров
			|ГДЕ
			|	ПродажаТоваров.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
		РезультатЗапроса = Запрос.Выполнить();
			
	Возврат РезультатЗапроса;

	КонецЕсли;
	
КонецФункции

Процедура ЗаписатьДанныеЗаполнения(РезультатЗапроса)
	
	Если НЕ ЗначениеЗаполнено(РезультатЗапроса) Тогда
		Текст = "Ввод Заявки на транспорт не возможен! 
				|Документ основание не заполнен";
		ОбщегоНазначенияВызовСервера.СообщитьПользователюСервер(Текст);
		Возврат;
	КонецЕсли;
		
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();		
	ВыборкаДетальныеЗаписи.Следующий(); 
	
	Если ВыборкаДетальныеЗаписи.СуммаДокумента < 1000 Тогда
		Текст = "Ввод Заявки на транспорт не возможен! 
				|Сумма заказа менее 1000 рублей!";
		ОбщегоНазначенияВызовСервера.СообщитьПользователюСервер(Текст);
		Возврат;
	КонецЕсли;
		
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ВыборкаДетальныеЗаписи);
	
КонецПроцедуры

Функция ПроверяемыеРеквизиты();
	
	ПроверяемыеРеквизиты = Новый Массив;
	Возврат ПроверяемыеРеквизиты;
		
КонецФункции

#КонецОбласти

#Иначе
	ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
